[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/Gp7Hwgx/The-Great-Gatsby.png",
    "review": "A timeless classic portraying the decadence and moral ambiguity of the Jazz Age. Fitzgerald's prose is both poetic and poignant, weaving a tale of love, wealth, and the pursuit of the American Dream. The characters are vividly drawn, and the story's themes resonate with readers across generations.",
    "totalPages": 180,
    "rating": 4.5,
    "category": "Fiction",
    "tags": ["Classic", "Romance"],
    "type": "Novel",
    "publisher": "Scribner",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/WzPsXbf/To-Kill-a-Mockingbird.png",
    "review": "An unforgettable story of racial injustice and moral growth in the American South. Harper Lee's masterpiece confronts deep-seated prejudices with compassion and integrity. Through the eyes of Scout Finch, we witness the courage of her father, Atticus, as he defends the innocent in a town plagued by bigotry. A timeless tale that challenges readers to examine their own beliefs and values.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Classic", "Social Justice"],
    "type": "Novel",
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/XtNR3GH/The-Catcher-in-the-Rye.png",
    "review": "A coming-of-age novel that captures the disillusionment of youth in post-war America. Salinger's protagonist, Holden Caulfield, is a compelling voice of adolescent angst and alienation. Through his journey in New York City, we confront themes of identity, innocence, and the search for authenticity. The narrative's raw honesty and emotional depth continue to resonate with readers of all ages.",
    "totalPages": 224,
    "rating": 4.3,
    "category": "Fiction",
    "tags": ["Coming of Age", "Literary"],
    "type": "Novel",
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 4,
    "bookName": "POLITCS And the English Language",
    "author": "George Orwell",
    "image": "https://i.ibb.co/jvtPP6x/George-Orwell.png",
    "review": "A dystopian masterpiece warning against totalitarianism and loss of individuality. Orwell's vision of a surveilled society remains chillingly relevant today. Through the eyes of Winston Smith, we witness the horrors of a regime that seeks to control not only actions but thoughts. '1984' serves as a stark reminder of the fragility of freedom and the importance of resistance.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Fiction",
    "tags": ["Dystopian", "Political"],
    "type": "Novel",
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 5,
    "bookName": "The Hitchhiker's Guide to the Galaxy",
    "author": "Douglas Adams",
    "image": "https://i.ibb.co/TcMB6XQ/The-Hitchhiker-s-Guide-to-the-Galaxy.png",
    "review": "A hilarious and satirical journey through space that challenges our perceptions of the universe. Douglas Adams' wit and imagination shine in this intergalactic romp. From the destruction of Earth to the search for the meaning of life, the story brims with absurdity and humor. Beneath the laughter lies a poignant commentary on the human condition and the quest for meaning.",
    "totalPages": 193,
    "rating": 4.6,
    "category": "Science Fiction",
    "tags": ["Satire", "Adventure"],
    "type": "Novel",
    "publisher": "Pan Books",
    "yearOfPublishing": 1979
  },
  {
    "bookId": 6,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/VQMQFTq/Pride-and-Prejudice.png",
    "review": "A witty and romantic exploration of societal expectations and the nature of love. Jane Austen's classic novel remains a timeless portrayal of Georgian England. Through the spirited Elizabeth Bennet and the enigmatic Mr. Darcy, we navigate themes of class, marriage, and personal integrity. Austen's sharp social commentary and sparkling dialogue continue to captivate readers two centuries after its publication.",
    "totalPages": 279,
    "rating": 4.9,
    "category": "Classic",
    "tags": ["Romance", "Satire"],
    "type": "Novel",
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  }
]
